import styles from "./styles.module.css";
import YouTube from "react-youtube";
const { prayer} = styles;
const Dauhur = () => {
  return (
    <div className={prayer}>
      <h3>صلاة الظهر</h3>
      <h4>كيفية صلاة الظهر</h4>
      <p>
        فإذا أُقيمت الصلاة، اصطفُّوا متساويين، ووقفوا بين يدي ربهم خاشعين، فإذا كبَّر الإمام تكبيرة الإحرام، تبِعه المأموم، وكبَّر خلفه، وتركوا الدنيا خلف ظهورهم، وأقبلوا على الله بقلوب خاشعة، وخضعت جوارحهم، وذلَّت نفوسهم لله رب العالمين.
        <br/>دعاء الاستفتاح: ثم يدعو دعاءَ الاستفتاح بعد تكبيرة الإحرام وقبل قراءة الفاتحة؛ عن علي بن أبي طالب رضي الله عنه، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة قال: «وجَّهتُ وجهي للذي فَطَرَ السماوات والأرض حنيفًا مسلمًا، وما أنا من المشركين، إن صلاتي ونسكي، ومحياي، ومماتي لله رب العالمين،
        لا شريك له، وبذلك أمرت وأنا من المسلمين، اللهم أنت الملك لا إله إلا أنت، أنت ربي وأنا عبدك، ظلمت نفسي، واعترفت بذنبي، فاغفر لي ذنوبي جميعًا، إنه لا يغفر الذنوب إلا أنت، واهدِني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت، واصرف عني سيئها لا يصرف عني سيئها إلا أنت، لبيك، وسعديك، والخير كله بيديك، والشر ليس إليك، أنا بك وإليك، تباركت وتعاليت، أستغفرك وأتوب إليك»؛ (رواه مسلم، وأبو داود، والترمذي، وأحمد، والدارمي، وغيرهم)، وإن شاءَ قالَ ما ثبت عن النبي صلى الله عليه وسلم من أدعية الاستفتاح الأخرى.
        <br />
        <br />

        قراءة الفاتحة: فإذا كبر تكبَّيرة الإحرام، ودعا دعاء الاستفتاح؛ قرأ فاتحة الكتاب: [بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ [الفاتحة: 1 - 7]، وهي ركن من أركان الصلاة لا تصح الصلاة بدونها؛ لحديث عبادة رضي الله عنه مرفوعًا: «لا صلاةَ لمن لم يقرأ بفاتحة الكتاب»؛ (رواه أبو داود، والترمذي، وابن حبان)، وتسقط الفاتحة عن مسبوق أدرك الإمام راكعًا؛ لحديث أبي بكرة رضي الله عنه: ((أنه انتهى إلى النبي صلى الله عليه وسلم وهو راكع، فركع قبل أن يصِلَ إلى الصف، فذكر ذلك للنبي صلى الله عليه وسلم فقال: «زادك الله حرصًا ولا تَعُدْ»؛ (رواه البخاري في صحيحه)، ولم يأمره النبي صلى الله عليه وسلم بقضاء الركعة التي أدرك ركوعها دون قراءتها، ولو كانت الركعة غير صحيحة، لَأمَرَهُ صلى الله عليه وسلم بإعادتها.
        <br />
        وقراءة الفاتحة ركن من أركان الصلاة، وقراءة السورة بعد الفاتحة من سنن الصلاة، والقيام من أركان الصلاة، فإن عجز عن القيام صلى قاعدًا، فإن صلى من قعودٍ وهو يستطيع القيام، فصلاته باطلة.
        <br />
        الركوع: ثم يركع حتى يستوي ظهره راكعًا مستويًا، وراحتاه على ركبتيه؛ وعن وابصة بن معبد رضي الله عنه قال: ((رأيت رسول الله صلى الله عليه وسلم يصلي، فكان إذا ركع سوَّى ظهره، حتى لو صُبَّ عليه الماء لاستقرَّ))؛ (رواه أبو يعلى في مسنده، والطبراني في الكبير، وغيرهما)، ويقول في ركوعه: سبحان ربي العظيم ثلاثًا، ولا يقرأ القرآن في ركوع، ولا سجود.
        <br />الرفع من الركوع: ثم يرفع رأسه من الركوع، رافعًا يديه بمحاذاة أذنيه، ويقول: سمع الله لمن حمده - إذا كان إمامًا أو منفردًا - ويقولان بعد قيامهما: ربنا ولك الحمد؛ لحديث أبي هريرة رضي الله عنه قال: ((كان النبي صلى الله عليه وسلم إذا قال: سمع الله لمن حمده، قال: «اللهم ربنا ولك الحمد»؛ (رواه البخاري في صحيحه)، أما إن كان مأمومًا فإنه يقول عند الرفع: «ربنا ولك الحمد»؛ لحديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «إذا قال الإمام: سمع الله لمن حمده، فقولوا: اللهم ربنا لك الحمد؛ فإنه من وافق قولُه قولَ الملائكة، غُفِرَ له ما تقدم من ذنبه»؛ (رواه البخاري ومسلم).
        <br />
        والأفضل للإمام والمنفرد والمأموم أن يزيدوا بعد ربنا ولك الحمد، فيقولوا: ((حمدًا كثيرًا طيبًا مباركًا فيه، ملءَ السماوات، وملء الأرض، وما بينهما، وملء ما شئت من شيء بعد، أهل الثناء والمجد، أحق ما قال العبد، وكلنا لك عبدٌ، اللهم لا مانع لِما أعطيت، ولا معطيَ لِما منعت، ولا ينفع ذا الجَدِّ منك الجَدُّ، اللهم طهِّرني بالثلج، والبَرد، والماء البارد، اللهم طهِّرني من الذنوب والخطايا، كما ينقَّى الثوب الأبيض من الوسخ))؛ (رواه مسلم عن أبي سعيد الخدري).
        <br />
        <br />
        السجود: يسجد مكبرًا، واضعًا ركبتيه قبل يديه إذا تيسَّر ذلك، فإن شق عليه قدَّم يديه قبل ركبتيه؛ لقول الله تعالى: يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ [الحج: 77]، ولحديث أبي هريرة رضي الله عنه في قصة المسيء صلاتَهُ: «ثم اسجد حتى تطمئنَّ ساجدًا»؛ (رواه البخاري).   ويقول في سجوده سبحان ربي الأعلى ثلاثًا، ويدعو بما شاء في السجود من خيري الدنيا والآخرة؛ لحديث أبي هريرة أن رسول الله صلى الله عليه وسلم قال:  «أقرب ‌ما ‌يكون ‌العبد ‌من ‌ربه وهو ساجد، فأكثروا الدعاء»؛ (رواه مسلم، وأبو داود، والنسائي، وغيرهم)، ولحديث ابن عباس رضي الله عنهما وفيه: «أما الركوعُ، فعظِّموا فيه الرب عز وجل، وأما السجود، فاجتهدوا في الدعاء، فقَمِنٌ أن يُستجاب لكم»؛ (رواه مسلم في صحيحه).
        <br />
        الجلوس بين السجدتين: ثم يجلس بين السجدتين؛ لحديث أبي هريرة في قصة المسيء صلاته: «ثم ارفع حتى تطمئن جالسًا»؛ (رواه البخاري ومسلم)، وتكون جلسة خفيفة بطمأنينة، ويقول فيها ما جاء في حديث ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم كان يقول بين السجدتين: «اللهم اغفر لي، وارحمني، وعافِني، واهدِني، وارزقني»؛ (رواه أبو داود، وابن ماجه، والترمذي).
        <br />
        الطمأنينة: يجب على المصلِّي أن يطمئن في الركوع، والرفع من الركوع، وفي السجود، وفي الجلوس بين السجدتين؛ وذلك لتأكيد النبي صلى الله عليه وسلم على الطمأنينة في حديث أبي هريرة في قصة المسيء صلاته، وهو حديث صحيح، (متفق عليه) ، وأقل الطمأنينة استقرار الأعضاء راكعًا، أو رافعًا من الركوع، أو ساجدًا، أو جالسًا بين السجدتين، ثم مقدار قول: سبحان ربي العظيم مرة واحدة على الأقل.   السجدة الثانية: وهي مثل السجدة الأولى في كل شيء، وبهذا تكون تمت الركعة الأولى.   الركعة الثانية: مثل الركعة الأولى في كل شيء، ما عدا دعاء الاستفتاح، ومن اسمه، فهو دعاء استفتاح الصلاة، فلا يكون إلا في الركعة الأولى، ويكون بعد تكبيرة الإحرام، وقبل قراءة الفاتحة.   التشهد الأول: ويكون بعد انتهاء الركعة الثانية، فإذا رفع المصلي رأسه من السجود الثاني في الركعة الثانية، جلس للتشهد الأول، ويقول فيه: «التحيات لله، والصلوات، والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا، وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله، وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله»؛ (متفق عليه).   والتشهد الأول من سنن الصلاة، ثم يقوم المصلي إلى الركعة الثالثة، وهي مثل الأولى تمامًا، ثم يقوم إلى الركعة الرابعة، وهي مثل سابقتها تمامًا، وفي الثالثة والرابعة يقرأ الفاتحة فقط، ولا يجهر الإمام بالقراءة.   التشهد الأخير: ويكون بعد تمام الركعة الرابعة، إذا رفع من السجود الثاني، ويقول فيه: «التحيات لله، والصلوات، والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا، وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله، وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله، اللهم صلِّ على محمد وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد»؛ (رواه مسلم).   الدعاء بعد التشهد الأخير وقبل السلام: اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال؛ لحديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «إذا تشهد أحدكم، فلْيَسْتَعِذْ بالله من أربع، يقول: اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال»؛ (متفق عليه).   السلام عن اليمين ثم عن اليسار: السلام عليكم ورحمة الله وبركاته، السلام عليكم ورحمة الله وبركاته.

      </p>
      <h4>سنة الظهر</h4>
      <p>
        سنة الظهر أربع قبلها، واثنتان بعدها؛ لحديث أم حبيبة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم: «من صلى في يوم وليلة ثنتي عشرة ركعة، بُنِيَ له بيت في الجنة: ‌أربعًا ‌قبل ‌الظهر، ‌وركعتين ‌بعدها، وركعتين بعد المغرب، وركعتين بعد العشاء، وركعتين قبل صلاة الفجر؛ صلاة الغداة»؛ (رواه الترمذي والنسائي، وغيرهما
        ).   <br/>  وإن أراد المسلم أن يحافظ على أربع قبل الظهر، وأربع بعدها، حرَّمه الله على النار؛ لحديث أم حبيبة رضي الله عنها قالت: سمعت رسول الله صلى الله عليه وسلم يقول: «من حافظ على أربع ركعات قبل الظهر، وأربع بعدها، حرَّمه الله على النار»
        ؛ (رواه أحمد، وأبو داود، والترمذي، والنسائي).
      </p>
      <h4>الأذكار بعد صلاة الظهر</h4>
      <p>
     يُستحبّ للمسلم أن يأتي بمجموعة من الأذكار بعد انتهائه من أداء صلاة الظهر، وهي كما يأتي:
<br/>
"أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله".
<br/>
"اللّهُمَّ أَنْتَ السَّلامُ ، وَمِنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَلالِ وَالإِكْرام".
<br/>
"لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ".
<br/>
"لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، لا حَوْلَ وَلَا قُوَّةَ إلَّا باللَّهِ، لا إلَهَ إلَّا اللَّهُ، وَلَا نَعْبُدُ إلَّا إيَّاهُ، له النِّعْمَةُ وَلَهُ الفَضْلُ، وَلَهُ الثَّنَاءُ الحَسَنُ، لا إلَهَ إلَّا اللَّهُ مُخْلِصِينَ له الدِّينَ ولو كَرِهَ الكَافِرُونَ".
<br/>
"سُبْحانَ اللهِ، والحَمْدُ لله ، واللهُ أكْبَر". 33 مرة
<br/>
"لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ".
<br/>
"سُبحانَ الملِكِ القدُّوسِ". 3 مرات
<br/>
"قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ*وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ". 3 مرات
<br/>
"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ*مِن شَرِّ مَا خَلَقَ*وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ*وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ*وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ". 3 مرات
<br/>
"قُلْ أَعُوذُ بِرَبِّ النَّاسِ*مَلِكِ النَّاسِ*إِلَٰهِ النَّاسِ*مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ*الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ*مِنَ الْجِنَّةِ وَالنَّاسِ". 3 مرات
<br/>
"اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ".
<br/>
"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ".
<br/>
"اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ".
<br/>
"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ".

<br/>
"لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُو على كُلِّ شَيءٍ قَدِيْرٍ، اللَّهُمَّ لا مَانِعَ لما أعْطَيْتَ، ولا مُعْطِي لما مَنَعْتَ، ولا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ".

      </p>
      <div >
        <h4>صلاة الظهر للرجال</h4>
        <YouTube className=" ratio ratio-16x9" style={{ padding: "20px" }} videoId="YNeMArtRkNY" />
        <h4>صلاة الظهر للنساء</h4>
        
        <YouTube className=" ratio ratio-16x9" style={{padding:"20px"}} videoId="e4g8ndWtSbM"/>

      </div>

      
    </div>
  )
}

export default Dauhur