import styles from "./styles.module.css";
import YouTube from 'react-youtube';




const { prayer} = styles;
const Fajr = () => {
  return (

    <div className={prayer}>
      <h3>صلاة الفجر</h3>
      <h4>كيفية صلاة الفجر</h4>
      <p>
      ركعتان، يجهر المصلي فيهما بالقراءة، وقد كان رسول الله صلى الله عليه وسلم يقرأ فيها بين الستين آية إلى المائة آية.

صفتها: أن يقف المصلي مستقبلًا القبلة، متطهرًا، ساترًا عورته، ويرفع يديه حذو منكبيه، قائلًا: "الله أكبر"، ثم يضع يده اليمنى على يده اليسرى، ويضعهما على صدره، ثم يقرأ دعاء الاستفتاح، فيقول: "سبحانك اللهم وبحمدك، وتبارك اسمك، وتعالى جدك، ولا إله غيرك"، ثم يستعيذ ويبسمل سرًّا، ثم يقرأ الفاتحة وسورة بعدها جهرًا، إذا لم يكن مأمومًا.

ثم يركع مكبرًا رافعًا يديه حذو منكبيه، ثم يضعهما على ركبتيه، كهيئة القابض عليهما، ثم يقول "سبحان ربي العظيم" ثلاثًا، وإن زاد، فهو أفضل، ثم يرفع رأسه، رافعًا يديه حذو منكبيه، قائلًا: "سمع الله لمن حمده"، وبعد قيامه يقول: "ربنا ولك الحمد حمدًا كثيرًا طيبًا مباركًا فيه".

ثم يسجد مكبرًا، ويمكّن جبهته، وأنفه، ويديه، وركبتيه، وأطراف قدميه إلى الأرض، ثم يقول: "سبحان ربي الأعلى" ثلاثًا، ويستحب له أن يدعو في سجوده، ثم يرفع رأسه مكبرًا، ويجلس مفترشًا رجله اليسرى ناصبًا رجله اليمنى، ويقول: "رب اغفر لي"، وإن زاد، فهو أفضل، ثم يسجد الثانية كالأولى، ثم يرفع رأسه مكبرًا، ويقف ويفعل في الثانية كما فعل في الركعة الأولى.

فإذا رفع رأسه من السجدة الثانية، جلس، وقرأ التشهد والصلاة الإبراهيمية، وصيغته: التحيات لله والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وأشهد أن محمدًا عبده ورسوله.. اللهم صلِّ على محمد، وعلى آل محمد، كما صليت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد.

ثم يستعيذ بالله من عذاب جهنم، وعذاب القبر، وفتنة المسيح الدجال، وفتنة المحيا والممات، ثم يسلم عن يمينه: السلام عليكم ورحمة الله، ثم عن يساره كذلك، فإذا فعل ذلك تمت صلاته.
      </p>
      <h4>سنة الفجر</h4>
      <p>
      ركعتان قبلها -بعد أذان الفجر- وهي من آكد السنن، لم يتركها رسول الله ‏صلى الله عليه وسلم حضراً ولا سفراً، والسنة تخفيفهما، والأفضل أن تقرئي بعد الفاتحة في ‏الأولى بـ( قل يا أيها الكافرون) وفي الثانية بـ ( قل هو الله أحد) ويشرع بعدهما ‏الاضطجاع على الشق الأيمن إلا إذا كان عندك من يحادثك أو خشيت النوم فتجلسين ‏حتى تصلي الفرض، ولا ينبغي الزيادة عليهما، فقد روى أحمد وأبو داود عن يسار مولى ‏ابن عمر قال: رآني ابن عمر وأنا أصلي بعد ما طلع الفجر فقال: " إن رسول الله صلى الله ‏وعليه وسلم خرج علينا ونحن نصلي هذه الساعة فقال: " ليبلغ شاهدكم غائبكم أن لا ‏صلاة بعد الصبح إلا ركعتين" وروى البيهقي عن سعيد بن المسيب رحمه الله تعالى: أنه ‏رأى رجلاً يصلي بعد طلوع الفجر أكثر من ركعتين يكثر فيهما الركوع والسجود فنهاه، ‏فقال: (يا أبا محمد يعذبني الله على الصلاة؟ قال: لا، ولكن يعذبك الله على خلاف السنة) ‏ومن صلى الفرض إن شاء انصرف، وإن شاء جلس في مصلاه وهو الأفضل، يذكر الله ‏ويصلي على رسول الله صلى الله عليه وسلم ويتلو القرآن، أو يتذاكر مع المصلين معه ‏حتى تطلع الشمس قدر رمح وهو: مقدار ربع ساعة تقريباً بعد وقت الشروق، ثم يصلي ركعتين يكتب الله ‏له بذلك أجر حجة وعمرة تامة، فعن أنس رضي الله عنه قال: قال رسول الله صلى الله ‏عليه وسلم: " من صلى الفجر في جماعة ثم قعد يذكر الله حتى تطلع الشمس ثم صلى ‏ركعتين، كانت له كأجر حجة وعمرة تامة تامة تامة" رواه الترمذي وله شواهد يرقى ‏بها إلى درجة الحسن. والتنفل بين هذين الوقتين منهي عنه، قال رسول الله صلى الله عليه ‏وسلم: " لا صلاة بعد صلاة العصر حتى تغرب الشمس، ولا صلاة بعد صلاة الصبح حتى ‏تطلع الشمس وترتفع…"‏.
      </p>
      <h4>الأذكار بعد صلاة الفجر</h4>
      <p>لقد صحّ عن النّبي - صلّى الله عليه وسلّم - أحاديث وأدعية، وأذكار كثيرة، وهي تقال دبر الصّلوات عموماً، وبعد صلاة الفجر خصوصاً، ومن أعظم ما ورد من أدعية تخصّ صلاة الفجر، هو ما رواه أحمد وابن ماجه عن أم سلمة رضي الله عنها قالت:" كان النّبي يقول إذا صلّى الصّبح حين يسلم: اللهم إنّي أسألك علماً نافعاً، ورزقاً طيّباً، وعملاً متقبلاً ". وقد روى الترمذي، وقال: حسن صحيح، وصحّحه الألباني في صحيح الترغيب والترهيب، أنّ النّبي - صلّى الله عليه وسلّم - قال:" من قال: دبر صلاة الفجر وهو ثانٍ رجليه قبل أن يتكلم: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، يحيي ويميت وهو على كلّ شيء قدير عشر مرات، كتب الله له عشر حسنات، ومحا عنه عشر سيّئات، ورفع له عشر درجات، وكان يومه ذلك في حرز من كلّ مكروه، وحرس من الشّيطان ولم ينبغ لذنب أن يدركه في ذلك اليوم؛ إلا الشّرك بالله عزّ وجلّ ". وروى أبو داود وابن حبان، أنّ النّبي - صلّى الله عليه وسلّم - كان يقول بعد الفجر والمغرب:" اللهم أجرني من النّار، سبع مرّات "، وإنّ للمسلم أن يدعو بما شاء، ويتخيّر من الدّعاء أجمعه وأنفعه.
</p>
      <div >
        <h4>صلاة الفجر للرجال</h4>
        <YouTube className=" ratio ratio-16x9" style={{ padding: "20px" }} videoId="G6mG953SinE" />
        <h4>صلاة الفجر للنساء</h4>
        
        <YouTube className=" ratio ratio-16x9" style={{padding:"20px"}} videoId="8fe2aRz-deM"/>

      </div>

      
    </div>
  )
}

export default Fajr