import YouTube from "react-youtube";
import styles from "./styles.module.css";
const { prayer} = styles;
const Isha = () => {
  return (
    <div className={prayer}>
      <h3>كيفية صلاة العشاء</h3>
      <p>
        أجمع العلماء؛ مما ورد عن النبي صلى الله عليه وسلم على أنّ صلاة العِشاء تؤدّى أربع ركعاتٍ في الإقامة، وركعتان في السفر، يجهر المُصلّي إماماً أو منفرداً في قراءته في أوّل ركعتَين، ويُسرّ في الآخرتَين، ويجلس للتشهّد بعد أول ركعتين، ويجلس للتشهد الأخير وتُؤدّى صلاة العِشاء بالكيفيّة التي تُؤدّى بها باقي الصلوات، وبيان ذلك فيما يأتي
        :
        <br />
        <span>النّية </span>
         يتوجّه المُصلّي نحو القِبلة بكامل جسده، وينوي في قلبه أداء صلاة العِشاء
        <br />
        <span>تكبيرة الإحرام </span>
         يرفع يديه إزاء منكبَيه مكبراً تكبيرة الإحرام؛ بقَوْل: "الله أكبر"، ثمّ يضع يدَيه على صدره، بجَعْل كفّه الأيمن على ظهر كفّه الأيسر.
        <br />
        <span>دعاء الاستفتاح </span>
       يقرأ دعاء الاستفتاح، فقد أخرج الإمام البخاريّ عن أبي هريرة -رضي الله عنه- أنّه قال: (كانَ رَسولُ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- يَسْكُتُ بيْنَ التَّكْبِيرِ وبيْنَ القِرَاءَةِ إسْكَاتَةً -قالَ أَحْسِبُهُ قالَ: هُنَيَّةً- فَقُلتُ: بأَبِي وأُمِّي يا رَسولَ اللَّهِ، إسْكَاتُكَ بيْنَ التَّكْبِيرِ والقِرَاءَةِ ما تَقُولُ؟ قالَ: أَقُولُ: اللَّهُمَّ بَاعِدْ بَيْنِي وبيْنَ خَطَايَايَ، كما بَاعَدْتَ بيْنَ المَشْرِقِ والمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَايَ بالمَاءِ والثَّلْجِ والبَرَدِ).
        <br />
        <span>
        قراءة الفاتحة وما تيسر من القرآن
        </span>
         يتعوّذ من الشيطان بقَوْل: "أعوذ بالله من الشيطان الرجيم"، ثمّ يقرأ البسملة بقَوْل: "بسم الله الرحمن الرحيم"، ثمّ يقرأ سورة الفاتحة، ويُردفها بقَوْل: "آمين"، وهي ما تحمل في معناها طلب استجابة الدعاء، ثمّ يقرأ ما يشاء من القرآن الكريم.
        <br />
        <span>الركوع </span>
        يُكبّر رافعاً يدَيه إزاء منكبَيه ويركع؛ تعظيماً لله -تعالى-، ويكون بانحناء الظَّهْر، ووضع كفيّ اليدَين على الركبَتين، مع التباعد بين الأصابع، ويقول ثلاث مرّاتٍ: "سبحان ربّي العظيم"، وتُستحسن الزيادة على ذلك بقَوْل: "سبحانك اللهمَّ وبحمدك، اللهمّ اغفر لي".
        <br />
        <span>الرفع من الركوع </span>
        يرفع ظَهْره بعد إتمام الرُّكوع مع رَفْع يدَيه إزاء منكبيَه، قائلا أثناء ذلك: "سَمِعَ الله لِمَن حمده"، حال كَوْنه منفرداً أو إماماً، ويقول حال كونه مأموماً: "ربّنا ولك الحمد"، ثمّ يُكمل بعد أن يستقيم ظَهْره الدُّعاء الذي رواه الألبانيّ عن علي بن أبي طالب -رضي الله عنه-، إذ قال: (كانَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ إذا رفعَ رأسَهُ منَ الرُّكوعِ قالَ: سمعَ اللَّهُ لمن حمدَهُ ربَّنا ولَكَ الحمدُ ملءَ السَّماواتِ والأرضِ، وملءَ ما بينَهُما، وملءَ ما شئتَ من شيءٍ بعدُ).
        <br />
        <span>السجدة الأولى </span>
        يكبّر لِأداء سجدتَين؛ خشوعاً لله -تعالى-، على نحوٍ يلامس فيه الأرض بأعضائه السَّبعة، وهي: الجبهة مع الأنف، والكفَّين، والركبَتين، والقدَمين بأطرافهما، مع الحرص على مُباعدة العضُدَين عن الجنبَين، وعدم بَسْط الذراعَين على الأرض، وتوجيه رؤوس أصابع القدَمين نحو القِبلة، والقَوْل ثلاث مرّاتٍ: "سبحان ربي الأعلى"، وتُستحسن الزيادة على ذلك بقَوْل: "سبحانك اللهمَّ وبحمدك، اللهمّ اغفر لي". 
        <br />
        <span>الرفع من السجدة الأولى </span>
        يكبّر عند رَفْع رأسه من السَّجدة الأولى جالساً على قدمه اليُسرى، وناصباً اليُمنى، ثمّ يضع يده اليُمنى على فخذه الأيمن ممّا تَبِع ركبته مقبوضة الخُنصر والبُنصر، مرفوعة السَّبابة ليُحرّكها حال الدعاء، مقرونة طرفَي الوسطى والإبهام ببعضهما كالحلقة، أمّا يده اليسرى فيبسط أصابعها، ويضعها على الفخذ الأيسر ممّا تَبِع ركبَته، ويقول: "ربِّ اغفر لي، وارحمني، واهدني، وارزقني، واجبرني، وعافني".
        <br />
        <span>السجدة الثانية </span>
        يكبّر لِأداء السَّجدة الثانية على نحوٍ مماثلٍ للسجدة الأولى قولاً وفعلاً. 
        <br />
        <span>الركعة الثانية </span>
        يقوم مُكبّراً؛ لِأداء الركعة الثانية على نحوٍ مماثلٍ للركعة الأولى قولاً وفعلاً باستثناء قراءة دعاء الاستفتاح. 
        <br />
        <span>التشهّد </span>
        يُنهي الركعة الثانية، ثمّ يكبر ويجلس على هيئةٍ مماثلةٍ لجلسته بين السَّجدتين، ويقرأ التشهّد الأوّل الذي رواه البخاريّ عن عبدالله بن مسعود -رضي الله عنه- عن رسول الله -صلّى الله عليه وسلّم- أنّه قال: (إنَّ اللَّهَ هو السَّلَامُ، فَإِذَا صَلَّى أحَدُكُمْ، فَلْيَقُلْ: التَّحِيَّاتُ لِلَّهِ والصَّلَوَاتُ والطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللَّهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللَّهِ الصَّالِحِينَ، فإنَّكُمْ إذَا قُلتُمُوهَا أصَابَتْ كُلَّ عَبْدٍ لِلَّهِ صَالِحٍ في السَّمَاءِ والأرْضِ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ).
        <br />
        <span>الركعة الثالثة والرابعة </span>
        يقوم مُكبّراً رافعاً يديَه إزاء منكبَيه؛ لِأداء باقي الرَّكعات على نحوٍ مماثل للركعة الثانية، مع الاقتصار في القراءة على سورة الفاتحة.
        <br />
        <span>التشهّد الأخير والسلام </span>
        يجلس بعد أن يُنهي السَّجدة الثانية من الركعة الرابعة مُتورِكّاً؛ ويكون ذلك بأن ينصب قدَمه اليُمنى مُخرجاً من تحت ساقها قدمه اليُسرى، ومُمكّناً مقعدته من الأرض، وواضعاً يدَيه على فخذَيه على نحوٍ يُماثل وضعهما في التشهّد الأوّل.  
        <br />
        يقرأ التشهّد كاملاً، مع قَوْل: "اللهمّ صلِّ على محمّدٍ وعلى آل محمّدٍ، كما صلّيت على إبراهيم وعلى آل إبراهيم إنّك حميدٌ مجيدٌ، وبارك على محمّدٍ وعلى آل محمّدٍ، كما باركت على إبراهيم وعلى آل إبراهيم إنّك حميدٌ مجيدٌ"، ثمّ ينهي صلاته بالتسليم يميناً ويساراً بقَوْل: "السلام عليكم ورحمة الله".
        <br />
        <span>ماذا يُقرأ في صلاة العشاء؟ </span>
        وردت العديد من الأحاديث النبويّة التي بيّنت هَدْي النّبيّ -صلّى الله عليه وسلّم- في القراءة في صلاة العشاء، ممّا يدلّ على أنّ الأمر واسعٌ يراعي اختلاف أحوال الناس وظروفهم، ومن تلك الأحاديث:
        <br />
        ما أخرجه الإمام البخاريّ عن جابر بن عبدالله -رضي الله عنه- أنّه قال: (كانَ يُصَلِّي مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ، ثُمَّ يَأْتي قَوْمَهُ فيُصَلِّي بهِمُ الصَّلَاةَ، فَقَرَأَ بهِمُ البَقَرَةَ، قالَ: فَتَجَوَّزَ رَجُلٌ فَصَلَّى صَلَاةً خَفِيفَةً، فَبَلَغَ ذلكَ مُعَاذًا، فَقالَ: إنَّه مُنَافِقٌ، فَبَلَغَ ذلكَ الرَّجُلَ، فأتَى النبيَّ صَلَّى اللهُ عليه وسلَّمَ فَقالَ: يا رَسولَ اللَّهِ، إنَّا قَوْمٌ نَعْمَلُ بأَيْدِينَا، ونَسْقِي بنَوَاضِحِنَا، وإنَّ مُعَاذًا صَلَّى بنَا البَارِحَةَ، فَقَرَأَ البَقَرَةَ، فَتَجَوَّزْتُ، فَزَعَمَ أنِّي مُنَافِقٌ، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: يا مُعَاذُ، أفَتَّانٌ أنْتَ - ثَلَاثًا - اقْرَأْ: والشَّمْسِ وضُحَاهَا وسَبِّحِ اسْمَ رَبِّكَ الأعْلَى ونَحْوَهَا)،
        فأمر رسول الله -صلّى الله عليه وسلّم- بقراءة سورتَي الضحى والأعلى ممّا يدلّ ذلك على أنّهما من هَدْيه.
        <br />

      </p>
      <h4>سنة العشاء</h4>
      <p>
ليس للعشاء سنة راتبة مؤكدة قبلها؛ لكن له أن يصلي ركعتين قبلها، كما يستحب أن يصلي ركعتين بين كل أذان وإقامة. أما بعد العشاء فالسنة الراتبة إنما هما ركعتان أيضا لا أربعا. ثم إذا صلى راتبة العشاء، فله أن يصلي بعد ذلك ما شاء الله له أن يصلي، من صلاة الليل، سواء قبل أن ينام أو بعد أن ينام ثم يستيقظ للصلاة وهو أفضل له وأكمل.
        <br />
        عن النبي ﷺ: صلوا قبل المغرب، صلوا قبل المغرب ثم قال في الثالثة: لمن شاء فدل على سنية الصلاة قبل المغرب ركعتين، وكان الصحابة يصلوا ركعتين قبل المغرب، يعني: بعد الأذان وقبل الإقامة ركعتين، هذا هو الأفضل، وهكذا العشاء إذا أذن المؤذن يصلي ركعتين؛ لقول النبي ﷺ: بين كل أذانين صلاة، بين كل أذانين صلاة وبين الأذانين صلاة بينها النبي ﷺ ينتظر فيها العشاء، فإذا أذن العشاء شرع للجالسين في المسجد أو الوافدين أن يصلوا ركعتين سنة قبل العشاء في حق المقيمين في المسجد، وسنة لمن دخل تحية المسجد، وفعل هذه السنة بين الأذانين يجمع بين الصلاة بين الأذانين وبين كونه أدى التحية. 
      </p>  
      <h4>الأذكار بعد صلاة العشاء</h4>
      <p>
      الأذكار بعد صلاة العشاء
يُستحبّ للمسلم عند انتهائه من أداء صلاة العشاء أن يذكر الله -تعالى- بما يشاء من خير الذِّكر والدعاء، وذلك على النحو الآتي:
<br/>
"أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله".
<br/>
"اللّهُمَّ أَنْتَ السَّلامُ ، وَمِنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَلالِ وَالإِكْرام".
<br/>
"لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ، وله الحَمْدُ، وهو علَى كُلِّ شيءٍ قَدِيرٌ، اللَّهُمَّ لا مَانِعَ لِما أعْطَيْتَ، ولَا مُعْطِيَ لِما مَنَعْتَ، ولَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ".
<br/>
"لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، لا حَوْلَ وَلَا قُوَّةَ إلَّا باللَّهِ، لا إلَهَ إلَّا اللَّهُ، وَلَا نَعْبُدُ إلَّا إيَّاهُ، له النِّعْمَةُ وَلَهُ الفَضْلُ، وَلَهُ الثَّنَاءُ الحَسَنُ، لا إلَهَ إلَّا اللَّهُ مُخْلِصِينَ له الدِّينَ ولو كَرِهَ الكَافِرُونَ".
<br/>
"سُبْحانَ اللهِ، والحَمْدُ لله ، واللهُ أكْبَر". 33 مرة
<br/>
"لا إلَهَ إلَّا اللَّهُ وَحْدَهُ لا شَرِيكَ له، له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ".
<br/>
"سُبحانَ الملِكِ القدُّوسِ". 3 مرات
<br/>
"قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ*وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ". 3 مرات
<br/>
"قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ*مِن شَرِّ مَا خَلَقَ*وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ*وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ*وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ". 3 مرات
<br/>
"قُلْ أَعُوذُ بِرَبِّ النَّاسِ*مَلِكِ النَّاسِ*إِلَٰهِ النَّاسِ*مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ*الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ*مِنَ الْجِنَّةِ وَالنَّاسِ".3 مرات
<br/>
"اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ".
<br/>
"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ".
<br/>
"اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ".
<br/>
"رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ".
<br/>
*"لا إلَهَ إلَّا الله وَحْدَهُ لا شَرِيْكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُو على كُلِّ شَيءٍ قَدِيْرٍ، اللَّهُمَّ لا مَانِعَ لما أعْطَيْتَ، ولا مُعْطِي لما مَنَعْتَ، ولا يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ".
<br/>
      </p>
      <div >
      <h4>صلاة العشاء للرجال</h4>
      <YouTube className=" ratio ratio-16x9" style={{ padding: "20px" }} videoId="5ApRM2exS1Q" />
      <h4>صلاة العشاء للنساء</h4>
      
      <YouTube className=" ratio ratio-16x9" style={{padding:"20px"}} videoId="Nn26XtTRrZA"/>

    </div>
    </div>
  )
}

export default Isha