import YouTube from "react-youtube";
import styles from "./styles.module.css";
const { prayer} = styles;

const Maghrib = () => {
  return (

    <div className={prayer}>
      <h3>صلاة المغرب</h3>
      <h4>كيفية صلاة المغرب</h4>
      <p>
        تؤدّى صلاة المغرب ثلاث ركعاتٍ، يجهر الإمام أو الرُّجل في أوّل ركعتَين، ويجلس بعدهما للتشهّد، ثُمّ يُؤدّي الركعة الثالثة، ويسرّ فيها بالقراءة، ويجلس بعدها للتشهّد الأخير، وتؤدّى وفق الخطوات الآتية: <br />
        استقبال المُصلّي للقبلة: حيث يستقبلها بجميع بَدَنه من غير انحرافٍ أو التفاتٍ، ثُمّ ينوي صلاة المغرب. تكبيرة الإحرام: ثُمّ يُكبّر تكبيرة الإحرام بقَوْل: "الله أكبر"، مع رَفْع اليدَين حذو المنكبَين، ثُمّ يضع كفّ يده اليُمنى على ظَهْر كفّ يده اليُسرى، ويضعهما على صَدْره. دعاء الاستفتاح: ثُمّ يقرأ دعاء الاستفتاح بأي صيغةٍ من صِيَغه، ومنها: (اللَّهُمَّ بَاعِدْ بَيْنِي وبيْنَ خَطَايَايَ كما بَاعَدْتَ بيْنَ المَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِن خَطَايَايَ كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِن خَطَايَايَ بالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ).<br/>
        قراءة الفاتحة وما تيسر من القرآن: يتعوّذ قائلاً: "أعوذ بالله من الشيطان الرجيم:، ثُمّ يُبسمل، ويقرأ سورة الفاتحة، ويقول بعدها: "آمين"، ويقرأ بعدها ما تيسّر له من القُرآن. الركوع: ثُمّ يركع بانحناء ظَهْره؛ تعظيماً لله -تعالى-، ويقول ثلاث مرّاتٍ: "سبحان ربي العظيم"، ويجوز له أن يزيد بقَوْل: "سبحانك اللهمّ وبحمدك اللهمّ اغفر لي". الرفع من الركوع: ثمّ يرفع رأسه بعد الانتهاء من الركوع قائلاً: "سَمِع الله لمن حمده"، مع رفع يدَيه حذو منكبَيه، وإن كان مأموماً فيقول: "ربنا ولك الحمد". السجدة الأولى: ثُمّ يسجد السَّجدة الأولى قائلاً: "الله أكبر"، ويسجد على أعضائه السبعة، وهي: الجبهة مع الأنف، والكفَّين، والركبَتين، وأطراف القدَمين، ويُباعد عضُديه عن جنَبْيه، ولا يبسط الذراعين على الأرض، ويقول في سجوده ثلاث مرّاتٍ: "سبحان ربّي الأعلى". الرفع من السجدة الأولى: ثُمّ يرفع من السُّجود قائلاً: "الله أكبر، ثُمّ يجلس على قدمه اليُسرى مع نَصْب قدمه اليُمنى، مع وضع اليد اليُمنى على فخذه اليمين، ويده اليُسرى على فخذه اليُسرى، ويقول: "رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني". السجدة الثانية: ثُمّ يسجد السَّجدة الثانيّة، ويفعل كما فعل في السجدة الأولى، ثُمّ يقوم من السُّجود قائلاً: "الله أكبر". الركعة الثانية: يبدأ بالركعة الثانيّة، ويفعل كما فعل في الركعة الأولى من غير الاستفتاح. التشهد: ثمّ يجلس للتشهّد بعد القيام من السجدة الثانية في الركعة الثانية، ويقول: (التَّحِيَّاتُ لِلَّهِ والصَّلَوَاتُ والطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أيُّها النبيُّ ورَحْمَةُ اللَّهِ وبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وعلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أشْهَدُ أنْ لا إلَهَ إلَّا اللَّهُ، وأَشْهَدُ أنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ)
        <br/>الركعة الثالثة: ثُمّ يقوم من التشهّد قائلاً: "الله أكبر"، ثُمّ يُؤدي الركعة الثالثة، ويقرأ سورة الفاتحة فقط من غير أن يقرأ بشيءٍ من القُرآن بعدها، ويفعل كما فعل في الركعتَين الأوليين. التشهد الأخير والسلام: ثُمّ يجلس للتشهّد الأخير متورّكاً، بنَصْب قدمه اليُمنى وإخراج قدمه اليُسرى من تحت اليُمنى، ويقرأ التشهّد، ويزيد عليه قائلاً: "اللهمَّ صلِّ على محمّدٍ وعلى آل محمّدٍ، كما صلّيت على إبراهيم وعلى آل إبراهيم إنّك حميدٌ مجيدٌ، وبارك على محمّدٍ وعلى آل محمّدٍ، كما باركت على إبراهيم وعلى آل إبراهيم إنّك حميدٌ مجيدٌ"، ثُمّ يُسلّم عن اليمين واليسار قائلاً: "السلام عليكم ورحمة الله".
      </p>
      <h4>سنة المغرب</h4>
      <p>
      المعروف عنه ﷺ أنه كان يصلي بعد المغرب ركعتين راتبة، وروي عنه ﷺ أنه صلى قبل المغرب ركعتين رواه ابن حبان، ولكن المشهور عنه ﷺ إنما هو الصلاة بعد المغرب ركعتين، هذه ثابتة عنه في الصحيحين وغيرهما. 
<br/>
وثبت عن الصحابة أنهم فعلوها بأمره ﷺ وبإقراره، كان الصحابة يصلون ركعتين وهو ينظر إليهم، وقد أمرهم بقوله: صلوا قبل المغرب، صلوا قبل المغرب ثم قال في الثالثة: لمن شاء فكانوا يفعلونها وهو ينظر -عليه الصلاة والسلام- فدل ذلك على سنيتها بعد الأذان، فهي ثابتة.. من قوله وتقريره، ثابتة من قوله وتقريره.
<br/>
أما فعله فهو محل نظر، وإن صححه ابن حبان، لكن محل نظر، لكنها ثابتة من قوله، قوله: صلوا قبل المغرب ومن تقريره للصحابة -رضي الله عنهم وأرضاهم- نعم.

      </p>
      
      <h4>الأذكار بعد صلاة المغرب</h4>
      <p>
      ورد في هذا أحاديث صحيحة عن النبي ﷺ كلها تدل على شرعية الذكر المذكور بعد صلاة الفجر وبعد صلاة المغرب، وهو أن يقول: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات، فيشرع لكل مؤمن ومؤمنة المحافظة على ذلك بعد الصلاتين المذكورتين. وذلك بعد الذكر المشروع بعد السلام من جميع الصلوات الخمس، وهو أن يقول بعد السلام: أستغفر الله، ثلاثا، اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام. لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. لا حول ولا قوة إلا بالله. لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن. لا إله إلا الله مخلصين له الدين ولو كره الكافرون. اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد.
        <br />
        وإن كان إمامًا شرع له الانصراف إلى الناس ويعطيهم وجهه بعد قوله: أستغفر الله ثلاثًا، اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام تأسيًا بالنبي ﷺ في ذلك. وللإمام عند الانصراف أن ينصرف عن يمينه أو عن شماله؛ لأن النبي ﷺ فعل هذا وهذا.
ويستحب للمصلي أيضًا بعد كل صلاة من الصلوات الخمس بعد الذكر المذكور أن يقول: سبحان الله، والحمد لله، والله أكبر ثلاثًا وثلاثين مرة. فتلك تسع وتسعون، ويقول تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير؛ لأنه قد صح عن النبي ﷺ الترغيب في ذلك وبيان أنه من أسباب المغفرة.
        <br />
        ويشرع للمصلي أيضا بعد كل صلاة من الصلوات الخمس: أن يقرأ آية الكرسي بعد هذه الأذكار وأن يقرأ: قل هو الله أحد، وقل أعوذ برب الفلق، وقل أعوذ برب الناس. ويشرع أن يكرر هذه السور الثلاث بعد المغرب وبعد الفجر وعند النوم ثلاث مرات؛ لورود الأحاديث الصحيحة في ذلك
      </p>


      <div >
        <h4>صلاة المغرب للرجال</h4>
        <YouTube className=" ratio ratio-16x9" style={{ padding: "20px" }} videoId="pkyF7shkDlY" />
        <h4>صلاة المغرب للنساء</h4>
        
        <YouTube className=" ratio ratio-16x9" style={{padding:"20px"}} videoId="34lfS249MOg"/>

      </div>
    </div>  )
}

export default Maghrib