import styles from "./styles.module.css";
const { arkan } = styles;

const Arkan = () => {
  return (
    <div className={arkan}>
      <h3>أركان الإيمان:</h3>
      <h4>الإيمان بالله عز وجل</h4>
      <p>هو الاعتقاد الجازم بوجود الله رباً وإلهاً ومعبوداً واحداً لا شريك له، والإيمان بأسمائه وصفاته التي وردت في القرآن وصحيح السنة النبوية من غير تحريف لمعانيها أو تشبيه لها بصفات خلقه أو تكييف أو تعطيل. نجد أن الإيمان بالله يكون من خلال التدبر في الكون والنفس، وتُرشد الآيات وتُعرّف ضرورة الإيمان بالله، وتبرهن برهانًا محكمًا وقاطعًا على وحدة الخالق. ﴿سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَى كُلِّ شَيْءٍ شَهِيدٌ ٥٣﴾ [فصلت:53]</p>
      <h4>الإيمان بالملائكة</h4>
      <p>المقصود من الإيمان بالملائكة هو الاعتقاد الجازم بأن الله خلق الملائكة من نور وهم موجودون، وأنهم لا يعصون الله ما أمرهم، وأنهم قائمون بوظائفهم التي أمرهم الله القيام بها. قال الله في سورة البقرة: ﴿لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَالْمَلَائِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَى حُبِّهِ ذَوِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُوا وَالصَّابِرِينَ فِي الْبَأْسَاءِ وَالضَّرَّاءِ وَحِينَ الْبَأْسِ أُولَئِكَ الَّذِينَ صَدَقُوا وَأُولَئِكَ هُمُ الْمُتَّقُونَ ١٧٧﴾ [البقرة:177]</p>
      <h4>الإيمان بالكتب السماوية</h4>
      <p>ومعنى هذا الإيمان بالكتب التي أنزلها الله على أنبيائه ورسله. ومن هذه الكتب ما وردت أسماؤها في القرآن، ومنها ما لم يُسمَّ، قال الله في سورة الأعلى: ﴿إِنَّ هَذَا لَفِي الصُّحُفِ الْأُولَى ١٨ صُحُفِ إِبْرَاهِيمَ وَمُوسَى ١٩﴾ [الأعلى:18–19]
      ونذكر فيما يلي الكتب التي وردت أسماؤها في القرآن: التوراة، الإنجيل، الزبور، صحف إبراهيم، قال الله في سورة البقرة: ﴿اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ٢٥٥﴾ [البقرة:255]، وفي سورة آل عمران: ﴿نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ وَأَنْزَلَ التَّوْرَاةَ وَالْإِنْجِيلَ ٣ مِنْ قَبْلُ هُدًى لِلنَّاسِ وَأَنْزَلَ الْفُرْقَانَ إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ وَاللَّهُ عَزِيزٌ ذُو انْتِقَامٍ ٤﴾ [آل عمران:3–4]. فالتوراة أُنزِل إلى موسى والإنجيل أُنزِل إلى عيسى والزبور إلى داود والصحف إلى إبراهيم والقرآن أُنزِل إلى محمد.</p>
      <h4>الإيمان بالأنبياء والرسل</h4>
      <p>هو الإيمان بالرسل والأنبياء المذكورين في القرآن، والإيمان بأن الله أرسل رسلاً سواهم، وأنبياء لا يُعلم عددُهم وأسماؤهم.

وقد ذكر الله في القرآن خمسة وعشرين من الأنبياء والرسل وهم: آدم، نوح، إدريس، صالح، إبراهيم، هود، لوط، يونس، إسماعيل، إسحاق، يعقوب، يوسف، أيوب، شعيب، موسى، هارون، اليسع، ذو الكفل، داوود، زكريا، سليمان، إلياس، يحيى، عيسى، محمد. فهؤلاء الرسل والأنبياء يجب الإيمان برسالتهم ونبوتهم.

الإيمان بالرسل هو الركن الرابع من أركان الإيمان، فلا يصح إيمان العبد إلا بالإيمان بهم. والأدلة تؤكد ذلك، فقد أمر الله بهم، وقرن ذلك بالإيمان به كما ذُكر في سورة النساء: ﴿يَا أَهْلَ الْكِتَابِ لَا تَغْلُوا فِي دِينِكُمْ وَلَا تَقُولُوا عَلَى اللَّهِ إِلَّا الْحَقَّ إِنَّمَا الْمَسِيحُ عِيسَى ابْنُ مَرْيَمَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ فَآمِنُوا بِاللَّهِ وَرُسُلِهِ وَلَا تَقُولُوا ثَلَاثَةٌ انْتَهُوا خَيْرًا لَكُمْ إِنَّمَا اللَّهُ إِلَهٌ وَاحِدٌ سُبْحَانَهُ أَنْ يَكُونَ لَهُ وَلَدٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَكَفَى بِاللَّهِ وَكِيلًا ١٧١﴾ [النساء:171]، وجاء الإيمان بهم في المرتبة الرابعة من التعريف النبوي للإيمان كما في حديث جبريل: (أن تؤمن بالله وملائكته وكتبه ورسله.) رواه مسلم. وقرن الله الكفر بالرسل بالكفر به، كما في سورة النساء: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ وَمَنْ يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا ١٣٦﴾ [النساء:136]، ففي هذه الآيات دليل على ضرورة الإيمان بالرسل، ومنزلته من الدين، وقبل بسط الكلام في ذلك، يجدر بنا ذكر تعريف كل من الرسول والنبي، وتوضيح الفرق بينهما.

الرسول هو الذي أُنزل عليه كتاب وشرع مستقل ومعجزة تثبت نبوءته وأمره الله بدعوة قومه لعبادة الله. أما النبي هو الذي لم ينزل عليه كتاب إنما أوحي إليه أن يدعو قومه لشريعة رسول قبله مثل أنبياء بني إسرائيل كانوا يدعون لشريعة موسى وما في التوراة، وعلى ذلك يكون كل رسول نبياً وليس كل نبي رسولاً. كما يجب على المؤمن الإيمان بهم جميعاً فمن كفر بواحد منهم أصبح كافراً بالجميع وذلك لأنهم جميعاً يدعون إلى شريعة واحدة وهي عبادة الله.</p>
      <h4>الإيمان باليوم الآخر</h4>
      <p>ومعناه الإيمان بكل ما أخبر به الله ورسوله محمد مما يكون بعد الموت من فتنة القبر وعذابه ونعيمه، والبعث والحشر والصحف والحساب والميزان والحوض والصراط والشفاعة والجنة والنار، وما أعد الله لأهلهما جميعاً.</p>
      <h4>الإيمان بالقضاء وبالقدر خيره وشره</h4>
      <p>إن خالق الخير والشر هو الله فكل ما في الوجود من خير وشر فهو بتقدير الله. وأن أعمال العباد من خير هي بتقدير الله ومحبته ورضاه، أما أعمال العباد من شر فهي كذلك بتقدير الله ولكن ليست بمحبته ولا برضاه، والإيمان بالقدر ركن من أركان الإيمان، وقد دلت الأدلة من الكتاب والسنة على إثباته وتقريره. فمن الكتاب: ﴿إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ ٤٩﴾ [القمر:49]، ﴿الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا ٢﴾ [الفرقان:2].
أما في السنة فيدل عليه حديث جبريل وسؤاله للنبي عن أركان الإيمان فقال: «الإيمان أن تؤمن بالله وملائكته وكتبه، ورسله واليوم الآخر وتؤمن بالقدر خيره وشره»، رواه مسلم.</p>
    
    </div>
  )
}

export default Arkan