import styles from "./styles.module.css";
const { arkan } = styles;
const ArkanIslam = () => {
  return (
    <div className={arkan}>
      <h3>أركان الإسلام الخمسة:</h3>
      <h4>الشهادتان</h4>
      <p>الشهادتان هما الإعلان عن الإيمان من دون شك، وتصريح بأن ليس هناك إله في الوجود إلا الله، وأن محمداً رسول مرسل للناس من الله. نص الشهادة هي: أشهد أن لا إله إلا الله وأشهد أن محمداً رسول الله. وهذا النص يُقال يومياً في صلاة المسلمين، وهو أيضاً المفتاح الرئيسي لدخول شخص غير مسلم في الإسلام.

الشهادتان هي أول الأركان وأهمها، فهي المفتاح الذي يدخل به الإنسان إلى دائرة الإسلام. فأما الطرف الأول منها «لا إله إلا الله» فمعناه أن ينطق الإنسان بلسانه ويقر في نفس الوقت بقلبه ويقر بجوارحه ويعمل بما تقتضيه هذه الكلمة-فلا بد من تلازم القول والعمل والقلب فكم من قائل لها لا يعرف معناها ولا يعمل به فبالتالي لا يكون مسلما- بأنه لا يوجد إله إلا الله وعليه يتوكل المسلم، وتقتضي الشهادة أيضاً أن يؤمن الإنسان أن لا خالق لهذا الكون إلا الله وحده دون شريك ولا إله ثانٍ ولا ثالث يُعبد معه.

أما شهادة أن محمداً رسول الله، فتعني أن تؤمن بأن النبي محمدا (صلى الله عليه وعلى آله وسلم) مبعوث من الله رحمة للعالمين، بشيراً ونذيراً إلى الخلق كافة، وتؤمن بأن شريعته ناسخة لما سبقها من الشرائع. ذكر القرآن: ﴿وَمَنْ يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ وَهُوَ فِي الْآخِرَةِ مِنَ الْخَاسِرِينَ ٨٥﴾ [آل عمران:85] (آل عمران الأية 85).

وتقتضي أيضاً أن يأخذ الإنسان من تعاليم النبي محمد (صلى الله عليه وعلى آله وسلم) ما أمر به أن يؤخذ ويمتنع عمّا نهى عنه.

ومن الملاحظ أنه في كون الشهادتين ركناً واحداً إشارة واضحة إلى أن العبادة لا تتم إلا في أمرين هما: إخلاص العبادة لله وحده واتباع منهج الرسول في هذه العبادة وعدم الخروج عما سنه الرسول للأمة</p>
      <h4>إقامة الصلاة</h4>
      <p>الصلاة هي الركن الثاني من أركان الإسلام، لقول النبي محمد-ﷺ -: «بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمداً رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وحج البيت من استطاع إليه سبيلاً»، وقوله أيضاً: «رأس الأمر الإسلام، وعموده الصلاة، وذروة سنامه الجهاد في سبيل الله»، والصلاة واجبة على كل مسلم، بالغ، عاقل، ذكر كان أو أنثى، وقد فرضت الصلاة في مكة قبل هجرة النبي محمد إلى يثرب في السنة الثالثة من البعثة النبوية، وذلك أثناء رحلة الإسراء والمعراج بحسب المعتقد الإسلامي.

فُرضت الصلاة في الإسلام خمس مرات في اليوم على المسلمين تقام في خمسة أوقات مختلفة على طول اليوم، وهذه الأوقات هي: الفجر، الظهر، العصر، المغرب، العشاء.

في الإسلام تؤدى الصلاة خمس مرات يومياً فرضا على كل مسلم بالغ عاقل وخالٍ من الأعذار، بالإضافة لأنواع أخرى من الصلاة تُمارس في مناسبات وأوقات مختلفة مثل صلاة العيد وصلاة الجنازة وصلاة الاستسقاء وصلاة الكسوف.

وتعتبر الصلاة وسيلة مناجاة بين العبد -الذي بلغ الحُلُم وصار مُكلّفا- وربّه.
      </p>
      
      <h4>إيتاء الزكاة</h4>
      <p>وإيتاء الزكاة هو عبادة مالية فرضها الله على عباده، طهرة لنفوسهم من البخل، ولصحائفهم من الخطايا، وقد ذكر الله في كتابه: ﴿خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا﴾ [التوبة:103].

وقد فرض الله على المسلمين زكاتين، زكاة الفطر وهي التي تؤدى بعد شهر رمضان، وزكاة المال في أجناس مخصوصة.

وتُدفع الزكاة في مصارفها الثمانية للفقراء والمساكين.. ويسقط هذا الفرض عن الناس المعدمين الذين لا يملكون شيئاً.
      </p>
      
      <h4>الصوم</h4>
      <p>أما الصيام المفروض فهو:: صيام شهر رمضان. ويعتبر رمضان موسماً عظيماً تكثر فيه الطاعات وهو شهر مبارك تتنزل فيه الرحمة ويجدد فيه العبد عهده مع الله، ويتقرب اليه بالطاعات. ولصيام رمضان فضائل عدّة، فقد تكفل الله لمن صامه إيمانا واحتسابا بغفران ما مضى من ذنوبه وغيرها من الفضائل والأجر لمن صامه إيماناً بالله واحتساباً للأجر.

والمسلم يصوم عن الطعام والشراب ويمتنع عن اللغو والنميمة والمعاشرة الزوجية وكل عمل سيئ من طلوع الفجر (أي: من أول وقت صلاة الفجر) إلى غروب الشمس (أول وقت صلاة المغرب). ويقضي طوال يومه في عبادة وذكر وتلاوة للقرآن ودروس علم تعطيه زاداً إيمانياً يكفيه بقية العام.

ويسقط هذا الفرض عمن لا يقوى على صومه كمرض ألمّ به يُلزمه بتناول الدّواء أو كمريض قرحة المعدة الذي لا يقوى على المعدة الفارغة من الأكل والشرب.
      </p>
      
      <h4>حج البيت لمن استطاع إليه سبيلا</h4>
      <p>الحج هو زيارة المسجد الحرام في مكة المكرمة وأداء فريضة الحج. فرض الله هذا الفرض على كل مسلم بالغ، قادر على تحمّل تكاليف الحج. في القرآن: ﴿وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا﴾ [آل عمران:97].
وقد فرض الله الحج تزكيةً للنفوسِ، وتربيةً لها على معاني العبودية والطاعة والصبر، فضلاً على أنه فرصة عظيمة لتكفير الذنوب، فقد جاء في الحديث عن أبي هريرة: «من حج هذا البيت فلم يرفث ولم يفسق رجع كيوم ولدته أمه» البخاري ومسلم.
      </p>
      
    </div>
  )
}

export default ArkanIslam