import styles from "./styles.module.css";
const { arkan } = styles;
const ArkanSalah = () => {
  return (
    <div className={arkan}>
      <h3>الصلاة:</h3>
      <h4>أركان الصلاة</h4>
      <p>1- النية.
2- تكبيرة الإحرام.  
3- القيام في الفرض.
4- قراءة الفاتحة في كل ركعة.
5- الركوع.
6- القيام من الركوع.
7- السجود.
8- الجلوس بين السجدتين.
9- الطمأنينة في الجميع.
10- الجلوس للتشهد الأخير.
11- التشهد الأخير.
12- الصلاة على النبي صلى الله عليه وسلم بعد التشهد الأخير.
13- التسليم.
14- الترتيب بين الجميع.
</p>
      <h4>الواجبات</h4>
      <p>1- تكبيرات الانتقال في محلها، ومحلها ما بين بدء الانتقال وانتهائه.
2- التسميع: وهو قول: سمع الله لمن حمده عند الرفع من الركوع، وهو واجب على الإمام والمنفرد دون المأموم.
3- التحميد: وهو قول: ربنا ولك الحمد بعد الرفع من الركوع، وهو واجب على الإمام والمأموم والمنفرد.
4- التسبيح في الركوع، وهو قول: سبحان ربي العظيم.
5- التسبيح في السجود، وهو قول: سبحان ربي الأعلى.
6- قول: ربي اغفر لي. في الجلوس بين السجدتين.
        7- التشهد الأول والجلوس له.<br />
       
       فهذه هي واجبات الصلاة، والفرق بين الركن والواجب في الصلاة أن الركن إذا تركه المصلي سهواً أو نسياناً ثم ذكر، فيجب عليه أن يأتي به، ويسجد للسهو.
       <br />  
        وأما الواجب، فلا يجب عليه الإتيان به إذا تجاوز محله، ويجبره سجود السهو.
      </p>
      
      <h4>سنن الصلاة</h4>
      <p>1- رفع اليدين عند تكبيرة الإحرام، وعند الركوع، وعند الرفع منه، وعند القيام إلى الركعة الثالثة.
2- وضع اليد اليمنى على اليسرى في القيام.
3- دعاء الاستفتاح والاستعاذة بعد تكبيرة الإحرام.
4- قراءة شيء من القرآن بعد الفاتحة في الركعتين الأوليين.
5- التأمين عند الانتهاء من قراءة الفاتحة للإمام والمأموم والمنفرد جهراً في الصلاة الجهرية وسراً في الصلاة السرية 6- الزيادة على تسبيحة واحدة في الركوع والسجود 7- لاعتماد على الركبتين عند القيام.
      </p>
      
      <h4>مكروهات الصلاة</h4>
      <p> 1- السدل، وأقرب الأقوال للصواب في تعريفه: هو أن يطرح المصلي ثوباً على كتفيه، ولا يرد أحد طرفيه على الكتف الأخرى.
2- اشتمال الصماء، وهي: أن يتجلل الرجل بثوبه، ولا يرفع منه جانباً، ويدخل يديه من داخل فيركع ويسجد وهو كذلك، وإنما قيل لها صماء، لأنه يسد على يديه ورجليه المنافذ كلها كالصخرة الصماء التي ليس فيها خرق ولا صدع.
3- التلثم: وهو تغطية الفم بثوب ونحوه.
4- كف الشعر والثوب، أي ضمهما وجمعهما احترازاً من الانتشار أو التراب.
5- التشبه بالكفار، كوضع اليدين على الخاصرة، أو شد الوسط كالزنار، ونحو ذلك.
6- التشبه بالحيوان، كإقعاء الكلب في جلوس التشهد وهو: إلصاق الأليتين بالأرض، ونصب الساقين، ووضع اليدين على الأرض. وانبساط الكلب في السجود وهو: أن يلصق ذراعيه بالأرض وهو ساجد، وكالتفات الثعلب عند السلام، ونحو ذلك.
7- الحركة القليلة لغير حاجة، ومن ذلك الالتفات بالوجه أو العبث باليد في الثوب، أو اللحية، ونحو ذلك.
8- إلصاق البطن بالفخذين حال السجود.
        9- الصلاة في ثوب أو مكان مُلهٍ، وغير ذلك.</p>
    
    </div>
  )
}

export default ArkanSalah