import styles from "./styles.module.css";
const { arkan } = styles;
const Tashiud = () => {
  return (
    <div className={arkan}>
      <h3>التشهد</h3>
      <h4></h4>
      <p>
        <h6>  التحيات لله، والصلوات والطيبات، السلام عليك أيها النبي، ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله
        </h6>
       
        في التشهد الأول والثاني.<br/>
        التحيات في الجلوس الأول بعد الثانية، وفي الثالثة في المغرب، وفي الرابعة في الظهر والعصر والعشاء، ثم تقول بعدها في التشهد الأخير في الثالثة من المغرب، والرابعة من الظهر والعصر والعشاء، وفي صلاة الفجر، والجمعة، والعيدين، والاستسقاء.  
        تقول بعد هذا:
        <h6>        اللهم صل على محمد وعلى آل محمد، كما صليت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد.</h6>
      </p>
      <h4>صيغ أخرى للتشهد الأخير</h4>
      <p>
        صيغة الثانية
        <h6>     اللهم صل على محمد، وعلى آل محمد، كما صليت على آل إبراهيم، وبارك على محمد، وعلى آل محمد، كما باركت على آل إبراهيم، في العالمين إنك حميد مجيد</h6>
        صيغة ثالثة
       <h6> اللهم صل على محمد، وعلى أزواجه، وذريته، كما صليت على آل إبراهيم، وبارك على محمد، وعلى أزواجه، وذريته، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد.</h6>
       الصيغة الرابعة
        <h6>        اللهم صل على محمد عبدك ورسولك، كما صليت على إبراهيم، وبارك على محمد، وعلى آل محمد كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد. </h6>
        
        ثم تقول بعد هذا كله في التشهد الأخير الذي بعده السلام، تقول بعد ذلك:
        <h6>        اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال.           </h6>
        ويستحب الزيادة على هذا:
        <h6>        اللهم أعني على ذكرك، وشكرك، وحسن عبادتك؛ لأن الرسول أوصى بذلك -عليه الصلاة والسلام- اللهم أعني على ذكرك وشكرك، وحسن عبادتك قبل السلام</h6>
        دعاء آخر قبل السلام:
        <h6>
        اللهم إني ظلمت نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني، إنك أنت الغفور الرحيم نعيدها: اللهم إني ظلمت نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني، إنك أنت الغفور الرحيم.
          <br />
<br/>
          
النبي ﷺ أوصى أبا بكر بهذا الدعاء، وأوصى معاذًا بالدعاء الذي قبله: اللهم أعني على ذكرك... وهي وصية للجميع -لجميع المسلمين- وصيته لواحدٍ وصية للجميع -عليه الصلاة والسلام- وكلها سنة، ليست واجبة، نعم.</h6>
      </p>
    </div>
  )
}

export default Tashiud